In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("Titanic.csv")
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

#**Drop the unwanted columns**

In [4]:
#
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [5]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

**Convert String Data into Values, Using function Dummy**

In [6]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [7]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [8]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [13]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [14]:
model.fit(X_train,y_train)

GaussianNB()

In [15]:
model.score(X_test,y_test)

0.7910447761194029

In [16]:
X_test[0:10]

     Pclass        Age      Fare  female
156       3  16.000000    7.7333       1
544       1  50.000000  106.4250       0
255       3  29.000000   15.2458       1
264       3  29.699118    7.7500       1
650       3  29.699118    7.8958       0
615       2  24.000000   65.0000       1
198       3  29.699118    7.7500       1
424       3  18.000000   20.2125       0
707       1  42.000000   26.2875       0
508       3  28.000000   22.5250       0

In [17]:
y_test[0:10]

156    1
544    0
255    1
264    0
650    0
615    1
198    1
424    0
707    1
508    0
Name: Survived, dtype: int64

In [18]:
model.predict(X_test[0:10])

array([1, 1, 1, 1, 0, 1, 1, 0, 0, 0])

In [19]:


model.predict_proba(X_test[:10])

array([[0.40637055, 0.59362945],
       [0.09329535, 0.90670465],
       [0.4547671 , 0.5452329 ],
       [0.45063402, 0.54936598],
       [0.96830135, 0.03169865],
       [0.10670682, 0.89329318],
       [0.45063402, 0.54936598],
       [0.9639794 , 0.0360206 ],
       [0.74633749, 0.25366251],
       [0.96788348, 0.03211652]])

In [20]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.672     , 0.824     , 0.76      , 0.81451613, 0.77419355])